---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.RemoveConnectorLinkWarn
source: html/914c214c-d229-4ca6-3584-2c13637d2a28.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.RemoveConnectorLinkWarn Property

The link between connector [Index] and connector [Index] is removed.

## Syntax (C#)
```csharp
public static FailureDefinitionId RemoveConnectorLinkWarn { get; }
```